Revit 2027 API
DimensionSegmentArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DimensionSegmentArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As DimensionSegmentArrayIterator
public:
virtual DimensionSegmentArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DimensionSegmentArrayIterator
override ForwardIterator : unit -> DimensionSegmentArrayIterator
Return Value
DimensionSegmentArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace